zaremy/r2-z2/firmware/touch_check/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# No PSRAM: this app allocates nothing that needs it. (CONFIG_SPIRAM=y was also
# suspected of causing the serial silence during bring-up. It was tested and
# CLEARED -- turning it off changed nothing. It is off here because it is
# genuinely unneeded, not as a workaround.)

# NOT required -- kept only to make the routing explicit. An earlier version of
# this comment claimed it was REQUIRED for output to reach the host, because the
# IDF default (CONFIG_ESP_CONSOLE_UART_DEFAULT) puts stdout on UART0's physical
# pins. That was wrong: the secondary USB console carries app output anyway.
# Measured -- this app rebuilt with the line removed still printed every printf,
# and 00_bsp_quickstart ships the plain default and logs fine over USB. The one
# real cause of the silence is the ATTACH procedure; see main.c.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
